// Для проверки работы нужной программы нужно выделить код и нажать сочетание кнопок "Ctrl+/",
// далее ввести команду "dotnet run" в терминале

//==========================================================================

// Задача 10: Напишите программу, которая принимает на вход трёхзначное число
//  и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// Решение:

// Console.Write("Введите трехзначное число: ");
// int num = Convert.ToInt32(Console.ReadLine());
// int a = num / 100;
// int b = (num % 100) / 10;
// int c = num % 10;
// if (num >= 100 && num <= 999)
// {
//     Console.WriteLine($"Вторая цифра этого числа: {b}");
// }
// else
// {
//     Console.WriteLine("Введено не трехзначное число");
// }

//============================================================